Repository: top1Dron/olympiad-helper
Catalog: src/locale/*/LC_MESSAGES/django.po
Languages: uk

source: Competitions
uk: Змагання

source: Competition title
uk: Назва змагання

source: Competition start date
uk: Дата початку змагання

source: Competition end date
uk: Дата кінця змагання

source: End date have to go after start_date
uk: Дата завершення повинна бути після дати початку

source: Description
uk: Деталі

source: Competition
uk: Змагання

source: Input
uk: Вхід

source: Output
uk: Вихід

source: Time limit
uk: Ліміт часу

source: seconds
uk: секунд

source: Input example
uk: Вхідні дані

source: Output example
uk: Вихідні дані

source: No samples. Think by yourself.
uk: Прикладів немає. Придумайте їх самостійно.

source: Submit solution
uk: Відправити розв'язок

source: Add problem to competition
uk: Додати задачу до змагання

source: Hidden field
uk: Скрите поле

source: Type a problem
uk: Введіть номер або назву задачі

source: Solutions
uk: Розв'язки

source: Problem title
uk: Заголовок завдання

source: Author
uk: Автор

source: Programming language
uk: Мова програмування

source: Solving date
uk: Дата відправки

source: Status
uk: Статус

source: Time usage
uk: Затрачено часу

source: No submitted solutions in this competition yet.
uk: У цьому змаганні поки ніхто не відправляв розв'язки.

source: Solve competition problem
uk: Розв'язати задачу

source: Hidden field
uk: Скрите поле

source: Submit
uk: Відправити

source: Create competition
uk: Створити змагання

source: Create
uk: Створити

source: Problems
uk: Задачі

source: Leaderboard
uk: Дошка лідерів

source: Competition queue
uk: Розв'язки задач змагання

source: Start date
uk: Дата початку

source: End date
uk: Дата завершення

source: Group
uk: Група

source: No available competitions yet.
uk: На даний момент немає доступних змагань.

source: Number
uk: Номер

source: Title
uk: Заголовок

source: Delete?
uk: Видалити?

source: Not submitted
uk: Не відправлялась

source: No problems in this competition yet.
uk: У цьому змаганні поки немає задач для розв'язку.

source: User
uk: Користувач

source: Solved problems
uk: Кількість вирішених задач

source: Noone successfully solved at least 1 problem in competition yet.
uk: У цьому змаганні поки ніхто успішно не вирішив хоча б 1 задачу

source: Pending
uk: В очікуванні

source: Compilation error
uk: Помилка компіляції

source: Wrong answer
uk: Неправильна відповідь

source: Runtime error
uk: Помилка виконання

source: Partially accepted
uk: Частково зараховано

source: Timeout
uk: Вичерпано ліміт часу

source: Memory out
uk: Вичерпано ліміт пам'яті

source: Accepted
uk: Зараховано

source: Competition not found
uk: Змагання не знайдено

source: Problem not found
uk: Задачу не знайдено

source: Problem added successfully!
uk: Задачу додано успішно!

source: This problem is already in competition!
uk: Це завдання вже є у змаганні!

source: Problem in this competition not found
uk: У цьому змаганні поки немає задач для розв'язку.

source: Problem deleted from competition
uk: Задачу видалено зі змагання

source: English
uk: Англійська

source: Ukrainian
uk: Українська

source: Olympiad-helper administration
uk: Olympiad-helper адміністрація

source: Welcome to Olympiad-helper administration zone
uk: Ласкаво просимо до адміністративної зони Olympiad-helper

source: User groups
uk: Користувачі груп

source: Group name
uk: Назва групи

source: Group description
uk: Опис групи

source: Groups
uk: Групи

source: Teacher
uk: Вчитель

source: Student
uk: Студент

source: Role
uk: Роль

source: User group
uk: Користувацькі групи

source: Create group
uk: Створити групу

source: Members
uk: Учасники

source: Group competitions
uk: Групові змагання

source: No competitions in this group yet
uk: У цій групі поки не проводилися змагання

source: Active competitions
uk: Активні змагання

source: No active competitions in this group yet
uk: У цій групі на поточний час немає активних змагань

source: Active members
uk: Активні учасники

source: Member
uk: Учасник

source: No members in this group yet
uk: У цій групі поки немає учасників

source: Invite link
uk: Посилання на вступ до групи

source: No available groups yet
uk: Поки нема доступних груп

source: Group not found
uk: Групу не знайдено

source: User in this group not found
uk: Користувача у цій групі не знайдено

source: User deleted from group
uk: Користувача видалено із групи

source: Tests
uk: Тести

source: Judge
uk: Оціночна система

source: Problem number
uk: Номер задачі

source: Source code
uk: Код програми

source: You have to write problem number!
uk: Ви повинні вказати номер задачі!

source: You have to choose programming language!
uk: Ви повинні вибрати мову програмування!

source: You have to put your code! Solution can not be passed without it!
uk: Ви повинні внести свій код! Розв'язок задачі не може бути відправлений без нього!

source: Search problem
uk: Пошук задачі

source: All problems
uk: Всі задачі

source: Complexity
uk: Складність

source: Classification
uk: Класифікація

source: Programming languages
uk: Мови програмування

source: Very easy
uk: Дуже проста

source: Easy
uk: Проста

source: Middle
uk: Середня

source: Hard
uk: Складна

source: Very hard
uk: Дуже складна

source: Combinatorics
uk: Комбінаторика

source: Breadth-first-search
uk: Пошук-вглибину

source: Warning
uk: Попередження

source: Problem
uk: Задача

source: Sample input #
uk: Вхідні дані (приклад)

source: Sample output #
uk: Вихідні дані (приклад)

source: Problem samples
uk: Приклади до задачі

source: Problem tests
uk: Тести до задачі

source: Solution
uk: Розв'язкок

source: Solution tests
uk: Тести розв'язку

source: Publication date
uk: Дата публікації

source: User problem status
uk: Статус рішення задачі користувачем

source: User problem statuses
uk: Статуси рішення задач користувачами

source: No problems founded
uk: Жодної задачі не знайдено

source: Avg time usage
uk: Затрачено часу

source: Test
uk: Тест

source: Solve problem
uk: Вирішити задачу

source: Solution not found
uk: Розв'язок не знайдений

source: Body
uk: Текст статті

source: Article
uk: Стаття

source: Articles
uk: Статті

source: News
uk: Новини

source: Statistics
uk: Статистика

source: Most unsolvable problems
uk: Задачі, які розв'язують меньш за все

source: Solved count
uk: Кількість правильних розв'язків

source: Persent of resolve
uk: Відсоток правильних розв'язків

source: Most solvable problems
uk: Задачі, які розв'язують більш за все

source: Queue
uk: Черга

source: Profile
uk: Профіль

source: Edit profile
uk: Редагувати профіль

source: Logout
uk: Вийти

source: Sign in/Sign up
uk: Вхід/Реєстрація

source: Recommended literature
uk: Рекомендована література

source: How to solve a problem
uk: Як вирішити задачу

source: Grokking Algorithms
uk: Грокаем алгоритми

source: Solving Olympic problems on programming
uk: Вирішуємо олімпіадні задачі з програмування

source: Similar resources
uk: Схожі ресурси

source: Developed by Andrew Moshko
uk: Розробив Андрій Мошко

source: Password
uk: Пароль

source: Confirm your password reset on
uk: Підтвердіть вашу зміну пароля на

source: User with inputed email is not exists!
uk: Користувача з введеними поштою не зареєстровано у системі!

source: The user is blocked or not confused his mail!
uk: Користувача заблоковано або він не підтвердив свою пошту!

source: Email have to be setted
uk: Email повинен бути заданим

source: Superuser must have is_staff=True.
uk: Суперкористувач повинен мати is_staff=True.

source: Superuser must have is_superuser=True.
uk: Суперкористувач повинен мати is_superuser=True.

source: email address
uk: Email пошта

source: Users
uk: Користувачі

source: Hi
uk: Привіт

source: Please click on the link to confirm your registration
uk: Будь ласка, натисни на посилання для підтвердження реєстрації

source: Update
uk: Оновити

source: Login & Signup
uk: Вхід/Реєстрація

source: Login Form
uk: Форма входу

source: Signup Form
uk: Реєстрація

source: Login
uk: Вхід

source: Signup
uk: Реєстрація

source: Email Address
uk: Email пошта

source: Forgot password?
uk: Забули пароль?

source: Not a member
uk: Ще не зареєстровані?

source: Signup now
uk: Зареєструватися зараз

source: Username
uk: Нікнейм

source: Confirm password
uk: Підтвердіть пароль

source: Reset your password
uk: Зміна вашого пароля

source: Reset Password
uk: Зміна пароля

source: Confirm password reset
uk: Підтвердіть зміну пароля

source: Remembered password? Login
uk: Згадали пароль? Авторизуйтесь

source: Password reset
uk: Зміна паролю

source: Your password has been set. You can
uk: Ваш пароль було змінено. Ви можете

source: log in now
uk: авторизуйтесь зараз

source: Please, enter your new password twice:
uk: Будь ласка, введіть ваш пароль двічі:

source: Enter your new password
uk: Введіть ваш новий пароль

source: Change my password
uk: Змінити пароль

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
uk: Посилання на зміну пароля не дійсне. Можливо так сталося через те, що вона вже була використана.Будь-ласка, запросіть нове посилання на зміну пароля.

source: Reset your Password
uk: Змініть Ваш пароль

source: We've emailed you instructions for setting your password.
uk: Ми вислали інструкцію зі зміни пароля на вашу пошту.

source: You're receiving this email because you requested a password reset for your user account at
uk: Ви отримали цей лист так як ви запросили зміну пароля для вашогоаккаунту на

source: Your username, in case you’ve forgotten:
uk: Ваш логін, якщо ви його забули:

source: Thanks for using our site!
uk: Дякуємо за користуванням нашим сервісом!

source: The %(site_name)s team
uk: Команда %(site_name)s

source: Last visit at
uk: Останній раз онлайн був

source: Joined at
uk: Приєднався

source: Total submissions
uk: Усього відправлень

source: Accepted submits
uk: Зарахованих відпраленнь

source: User is not active!
uk: Користувач заблокований!

source: User with inputed email and password is not exists!
uk: Користувача з введеними поштою та паролем не зареєстровано у системі!

source: Activate your account.
uk: Активуйте свій аккаунт

source: Please, confirm your email address to complete the registration and login from this page! If you don't receive the email, check the spam folder!
uk: Будь ласка, підтвердіть вашу електронну пошту для завершення реєстрації та авторизуйтесь із цієї сторінки! Якщо ви не отримали листа, перевірте папку зі спамом!

source: Successfully account activation. Now you can login to your account!
uk: Успішна активація аккаунту. Тепере ви можете увійти до вашого аккаунту!

source: Activation link is invalid!
uk: Посилання активації не дійсне!
